/*******************************************************************************
 * www.neuheitbier.com.br
 * Funçao de execução da brassagem automatica panela cervejeira smart vessel
 * Autor: Milton Nogueira
 *
 * Criado em fevereiro de 2017
 * MPLAB X v2.35, XC8 v1.34
 *
 ******************************************************************************/

#include <xc.h>
#include <plib.h>
#include <stdlib.h>
#include <string.h>
#include "defines.h"
#include "display.h"

extern unsigned int ValoresAD[4];
unsigned char SetPointTempPanela;
extern unsigned char TotalHoras;
extern unsigned char TotalMinutos;
extern unsigned char TotalSegundos;
extern unsigned char PWMpanela;
extern unsigned char TonBomba,ToffBomba;           //1 a 99 minutos
extern unsigned char MinutosBomba;
extern bit EnviaDadoTrend;
unsigned char CanalADAtivo;                 //99 = todos canais
extern unsigned int TempoEncherVessel;
extern unsigned int FreeRunSegundos;
extern unsigned char Minutos;
extern unsigned char Segundos;
extern bit OnOffControleTemp;
extern bit TempPanelaOK;
extern struct ValoresReceita{
    unsigned char TemperaturaMashIn;    //0x10
    unsigned char TemperaturaFase1;     //0x11
    unsigned char TempoFase1;           //0x12
    unsigned char TemperaturaFase2;     //0x13
    unsigned char TempoFase2;           //0x14
    unsigned char TemperaturaFase3;     //0x15
    unsigned char TempoFase3;           //0x16
    unsigned char TemperaturaFase4;     //0x17
    unsigned char TempoFase4;           //0x18
    unsigned char TemperaturaFase5;     //0x19
    unsigned char TempoFase5;           //0x1A
    unsigned char TemperaturaMashOut;   //0x1B
    unsigned char TempoMashOut;         //0x1C
    unsigned char TemperaturaFervura;   //0x1D
    unsigned char TempoFervura;         //0x1E
    unsigned char TempoLupulo1;         //0x1F
    unsigned char TempoLupulo2;         //0x20
    unsigned char TempoLupulo3;         //0x21
    unsigned char TempoLupulo4;         //0x22
    unsigned char VolumeInicial;        //0x23
    unsigned char TempoLavagem;         //0x24
    unsigned char TempoMashIn;          //0x51
    unsigned char Nome[17];
};
extern struct ValoresReceita ReceitaAtual;
extern unsigned char TempoAdicionarAguaSparging;   //5 a 60 segundos
extern unsigned char TemperaturaSparging;          //60 a 90
extern bit ControlePotenciaFervura;

extern void EscreverDWINram(unsigned int endereco,int valor);
extern void EscreverDWINreg(unsigned char endereco,int valor);
extern int LerDWINram(unsigned int endereco);
extern int LerDWINreg(unsigned char endereco);
extern void EscreverDWINtrend(int valor);
extern void AcionaValvulaMotorizada(unsigned char sentido,unsigned char valvula);
extern void DelaySeg(unsigned char tempo);

void ExecutaBrassagem(void)
{
